Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: It also shows you which remote branches on the server you don’t yet have, which remote branches you have that have been removed from the server, and multiple branches that are automatically merged when you run `git pull`.
cs: Příkaz vám také oznámí, které vzdálené větve na serveru ještě nemáte, které vzdálené větve máte, ale ze serveru už byly odstraněny, a několik větví, které budou automaticky sloučeny, jestliže spustíte příkaz `git pull`.

source: It also still looks for /etc/gitconfig, although it’s relative to the MSys root, which is wherever you decide to install Git on your Windows system when you run the installer.
cs: I ve Windows se hledá soubor `/etc/gitconfig`, který je ale umístěn relativně v kořeni MSys, tedy vůči místu, do kterého jste se po spuštění instalačního programu rozhodli Git nainstalovat.

source: It can look for four primary whitespace issues — two are enabled by default and can be turned off, and two aren’t enabled by default but can be activated.
cs: Může vyhledávat čtyři základní chyby tohoto typu – dvě funkce jsou ve výchozím nastavení zapnuty a lze je vypnout, dvě nejsou zapnuty, avšak lze je aktivovat.

source: It cannot, however, replace the enormous amount of [documentation][gltoc] that Gitolite comes with.
cs: Nemůže ale nahradit ohromný objem [dokumentace][gltoc], která se s Gitolite dodává.

source: It contains tabs to different aspects of your projects.
cs: Obsahuje několik záložek k různým aspektům vašich projektů.

source: It does this so you don’t accidentally begin including generated binary files or other files that you did not mean to include.
cs: Díky tomu se nemůže stát, že budou do revizí nedopatřením zahrnuty vygenerované binární soubory nebo jiné soubory, které si nepřejete zahrnout.

source: It doesn’t take any parameters, but you can easily get the last commit by running `git log -1 HEAD`.
cs: Nepoužívá žádné parametry, ale spuštěním příkazu `git log -1 HEAD` lze snadno zobrazit poslední revizi.

source: It essentially rewinds the work you’ve done in your testing branch temporarily so you can go in a different direction.
cs: V podstatě dočasně vrátíte všechny změny, které jste provedli ve větvi testing, a vydáte se jiným směrem.

source: It generally takes a lot longer to clone or fetch from the repository, and you often have a lot more network overhead and transfer volume over HTTP than with any of the other network protocols.
cs: Klonovat nebo vyzvedávat data z repozitáře trvá v případě protokolu HTTP obecně mnohem déle a vyžádá si většinou podstatně větší režii síťových operací a objem přenášených dat, než je tomu u ostatních síťových protokolů.

source: It gets a list of all the commits you’re about to rewrite and checks whether they exist in any of your remote references.
cs: Použije seznam všech revizí, které hodláte přepsat, a ověří, zda neexistují už v některé z vašich vzdálených referencí.

source: It has paused the process while you resolve the conflict.
cs: Prozatím pozastavil celý proces do doby, než konflikt vyřešíte.

source: It is also the case that many Linux distributions contain very old packages; so unless you’re on a very up-to-date distro or are using backports, installing from source may be the best bet.
cs: Skutečností také je, že mnoho linuxových distribucí obsahuje velmi staré balíčky. Takže pokud nepoužíváte velmi čerstvou distribuci, nebo pokud záměrně používáte starší verzi, bývá instalace ze zdrojových souborů nejlepší volbou.

source: It is easy to forget which directory you’re in and accidentally write to the wrong file or copy over files you don’t mean to.
cs: Člověk snadno zapomene, ve kterém adresáři se právě nachází, a nedopatřením začne zapisovat do nesprávného souboru nebo přepíše nesprávné soubory.

source: It is very difficult to get the system to do anything that is not undoable or to make it erase data in any way.
cs: Přimět systém, aby udělal něco, co nelze vzít zpět, nebo aby smazal jakákoli data, je velice obtížné.

source: It keeps a special pointer called HEAD.
cs: Používá speciální ukazatel zvaný HEAD.

source: It lets you edit the default message before the commit author sees it.
cs: Umožňuje upravit výchozí zprávu dřív, než se zobrazí autorovi revize.

source: It lists the URL for the remote repository as well as the tracking branch information.
cs: Bude obsahovat adresu URL vzdáleného repozitáře a informace ke sledování větví.

source: It lists the changes you’ve staged on the left and unstaged changes on the right.
cs: Tento příkaz vypíše všechny změny, které jste připravili k zapsání, na levé straně, nepřipravené změny na pravé.

source: It lists the oldest at the top, rather than the newest, because that’s the first one it will replay.
cs: Seznam uvádí nejstarší revizi nahoře z toho důvodu, že to bude první revize, kterou příkaz přehraje.

source: It lists the shortnames of each remote handle you’ve specified.
cs: Systém vypíše krátké názvy, přes které se se vzdálenými repozitáři manipuluje, a které jste dříve určili.

source: It looks basically like this:
cs: V principu vypadá asi takto:

source: It looks like the bottom commit is the one you lost, so you can recover it by creating a new branch at that commit.
cs: Zdá se, že revize úplně dole je hledanou ztracenou revizí. Můžete ji obnovit tak, že na ní vytvoříte novou větev.

source: It looks something like this:
cs: Vypadá například takto:

source: It makes Git reconsider almost every aspect of version control that most other systems copied from the previous generation.
cs: Git díky tomu znovu zkoumá skoro každý aspekt správy verzí, které ostatní systémy kopírovaly z předchozí generace.

source: It may be easier to remember the `~3` because you’re trying to edit the last three commits; but keep in mind that you’re actually designating four commits ago, the parent of the last commit you want to edit:
cs: Snazší k zapamatování je varianta s výrazem `~3`, neboť se pokoušíte upravit poslední tři revize. Nezapomeňte ale, že tím ve skutečnosti označujete čtvrtou revizi od konce, tedy rodiče poslední revize, kterou chcete upravit:

source: It may be helpful to think of your branches as silos.
cs: Větve si můžeme představit jako zásobníky

source: It means that at the core of Git is a simple key-value data store.
cs: Znamená to, že v jádru systému Git se nachází jednoduché úložiště dat, ke kterému lze přistupovat pomocí klíčů.

source: It moved the HEAD pointer back to point to the `master` branch, and it reverted the files in your working directory back to the snapshot that `master` points to.
cs: Přemístil ukazatel `HEAD` zpět, takže nyní ukazuje na větev `master`, a vrátil soubory ve vašem pracovním adresáři zpět ke snímku, na nějž větev `master` ukazuje.

source: It must run its own daemon, which is custom — we’ll look at setting one up in the “Gitosis” section of this chapter — it requires `xinetd` configuration or the like, which isn’t always a walk in the park.
cs: Vyžaduje spuštění vlastního démona – na jeho nastavení se podíváme v části „Gitosis“ této kapitoly – a dále konfiguraci `xinetd` nebo podobnou, což není zrovna procházka růžovou zahradou.

source: It often happens that while working on one project, you need to use another project from within it.
cs: Často se stává, že pracujete na jednom projektu, ale na chvíli si potřebujete odskočit do jiného.

source: It performs a three-way merge between the two latest branch snapshots (C3 and C4) and the most recent common ancestor of the two (C2), creating a new snapshot (and commit), as shown in Figure 3-28.
cs: Ten provede třícestné sloučení mezi dvěma posledními snímky (C3 a C4) a jejich nejmladším společným předkem (C2), přičemž vytvoří nový snímek (a novou revizi) – viz obrázek 3-28.

source: It records the snapshots and then tries to figure out what was renamed implicitly, after the fact.
cs: Zaznamenává snímky a poté se snaží zjistit, co bylo později implicitně přejmenováno.

source: It rewrites every commit object downstream from the earliest tree you have to modify to remove a large file reference.
cs: Přepisují se všechny objekty revizí nacházejících se dál od vašeho nejstaršího objektu stromu, který musíte při odstraňování odkazu na velký soubor upravovat.

source: It sends all the objects it already has with "have" and then the SHA.
cs: Objekty, které už vlastní, uvádí kombinací výrazu „have“ (mám) a hodnoty SHA.

source: It should be fairly straightforward to determine which solution or combination of solutions is appropriate for you and your organization.
cs: Teď už byste se měli umět rozhodnout, které řešení nebo jaká kombinace řešení se pro vás a pro vaši organizaci hodí.

source: It shows you a list of your staged files, and you can select the ones for which you would like to see the staged diff.
cs: Příkaz zobrazí seznam připravených souborů. Můžete vybrat ty soubory, pro něž chcete zobrazit rozdíly připravených změn.

source: It shows you that a couple of lines are staged and a couple are unstaged.
cs: Oznamuje vám, že několik řádků je připravených k zapsání a několik není.

source: It shows you that the 'scott' user — the user with whose public key you initialized Gitosis — is the only one who has access to the `gitosis-admin` project.
cs: Tato informace znamená, že uživatel 'scott' – ten, jehož veřejným klíčem jste inicializovali Gitosis – je jediným uživatelem, který má přístup k projektu `gitosis-admin`.

source: It shows you what commit was the last to modify each line of any file.
cs: Ukáže vám, při které revizi byly jednotlivé řádky každého souboru naposledy změněny.

source: It starts with the 4 bytes specifying how much data is following, then the command to run followed by a null byte, and then the server’s hostname followed by a final null byte.
cs: Informace začínají 4 byty, které uvádějí, jaké množství dat následuje; po nich následuje příkaz, který má být spuštěn, nulový byte, název hostitelského serveru a na závěr další nulový byte.

source: It summarizes all the commits in the range you give it; for example, the following gives you a summary of all the commits since your last release, if your last release was named v1.0.1:
cs: Příkaz shrne všechny revize v zadaném rozmezí. Například následující příkaz zobrazí shrnutí všech revizí od posledního vydání (pokud bylo vaše poslední vydání pojmenováno v1.0.1):

source: It takes a list of references that are being pushed from stdin; if it exits non-zero, none of them are accepted.
cs: Skript používá seznam referencí, které jsou odesílány ze standardního vstupu stdin. Je-li návratová hodnota nenulová, nebude ani jedna z nich přijata.

source: It takes a single argument: the name of the temporary file that contains the proposed commit message.
cs: Používá jediný parametr: název dočasného souboru s požadovaným tvarem zprávy k revizi.

source: It takes no arguments and is run after the patch is applied, so you can use it to inspect the snapshot before making the commit.
cs: Nepoužívá žádné parametry a spouští se až po aplikaci záplaty, takže ho můžete využít k ověření snímku před zapsáním revize.

source: It takes only a few minutes to do.
cs: Celý postup nezabere víc než pár minut.

source: It takes quite a few commands, so you’ll learn about the common ones while going through a few small workflows.
cs: Je jich docela dost, takže se na několika modelových postupech seznámíme s těmi nejběžnějšími.

source: It takes the Git repository by itself, without a working directory, and creates a directory specifically for it alone.
cs: Oba vezmou samotný repozitář Git (bez pracovního adresáře) a vytvoří pro něj samostatný adresář.

source: It takes the patch that was introduced in a commit and tries to reapply it on the branch you’re currently on.
cs: Při této operaci vezme systém záplatu, která byla provedena v dané revizi, a pokusí se ji znovu aplikovat na větev, na níž se právě nacházíte.

source: It takes the same stdin data as the `pre-receive` hook.
cs: Používá stejná data ze standardního vstupu jako zásuvný modul `pre-receive`.

source: It tells you pretty explicitly how to discard the changes you’ve made (at least, the newer versions of Git, 1.6.1 and later, do this — if you have an older version, we highly recommend upgrading it to get some of these nicer usability features).
cs: Výpis vám sděluje, jak zahodit změny (discard changes), které jste provedli (přinejmenším tak činí novější verze systému Git, od verze 1.6.1; pokud máte starší verzi, doporučujeme ji aktualizovat, čímž získáte některé z těchto vylepšených funkcí).

source: It tells you the SHA-1 of the first bad commit and show some of the commit information and which files were modified in that commit so you can figure out what happened that may have introduced this bug:
cs: Sdělí vám SHA-1 první revize s chybou a zobrazí některé další informace o revizi a o tom, které soubory byly v této revizi změněny. Zjistíte tak, co bylo součástí revize a co může způsobovat hledanou chybu:

source: It tries to run a command on the remote server via an SSH call that looks something like this:
cs: Na vzdáleném serveru se pokusí spustit příkaz prostřednictvím volání SSH:

source: It turns out that Git stages a file exactly as it is when you run the `git add` command.
cs: Věc se má tak, že Git po spuštění příkazu `git add` připraví soubor k zapsání přesně ve tvaru, v jakém se nachází v daném okamžiku.

source: It turns out that it can.
cs: A podívejme, ono to jde.

source: It turns out that you can write your own filters for doing substitutions in files on commit/checkout.
cs: Jak zjistíte, můžete pro substituce v souborech určených k zapsání/checkoutu napsat i vlastní filtry.

source: It turns out there is no issue here, and you tell Git that by typing `git bisect good` and continue your journey:
cs: Ukáže se, že na této revizi k problému nedochází, a tak to systému Git sdělíte příkazem `git bisect good` a budete v hledání pokračovat:

source: It turns out you can do this fairly well using Git attributes.
cs: Nezapomínejme však na atributy Git, v této situaci vám odvedou nanahraditelnou službu.

source: It uses the same data-transfer mechanism as the SSH protocol but without the encryption and authentication overhead.
cs: Používá stejný mechanismus přenosu dat jako protokol SSH, na rozdíl od něj ale není zpomalován šifrováním a ověřováním identity (autentizací).

source: It will also use these values to help you when you apply patches with `git apply`.
cs: Git se těmito hodnotami řídí také při aplikaci záplat příkazem `git apply`.

source: It will start at the commit you specify on the command line (`HEAD~3`) and replay the changes introduced in each of these commits from top to bottom.
cs: Začne na revizi, kterou jste označili na příkazovém řádku (`HEAD~3`), a přehraje změny provedené v každé z těchto revizí od shora dolů.

source: It won’t create a commit for you — after running it, you must stage and commit the changes introduced manually.
cs: Tímto příkazem ostatně ani nezapíšete revizi, po jeho spuštění budete muset připravit a zapsat provedené změny ručně.

source: It works by going to the common ancestor of the two branches (the one you’re on and the one you’re rebasing onto), getting the diff introduced by each commit of the branch you’re on, saving those diffs to temporary files, resetting the current branch to the same commit as the branch you are rebasing onto, and finally applying each change in turn.
cs: Přeskládání funguje takto: systém najde společného předka obou větví (větve, na níž se nacházíte, a větve, na kterou přeskládáváte), provede příkaz diff pro všechny revize větve, na níž se nacházíte, uloží zjištěné rozdíly do dočasných souborů, vrátí aktuální větev na stejnou revizi jako větev, na kterou přeskládáváte, a nakonec po jedné aplikuje všechny změny.

source: It’s a good way to sneak Git into the corporate environment and help your fellow developers become more efficient while you lobby to get the infrastructure changed to support Git fully.
cs: Jistě nebude od věci, jestliže se pokusíte propašovat Git do prostředí vaší společnosti a lobbováním za změnu infrastruktury směrem k plné podpoře systému Git pomůžete svým kolegům-vývojářům k vyšší efektivitě práce.

source: It’s almost identical to running a `patch -p1` command to apply the patch, although it’s more paranoid and accepts fewer fuzzy matches than patch.
cs: Je to téměř stejné, jako byste k aplikaci záplaty použili příkaz `patch -p1`. Tento postup je však přísnější a nepřijímá tolik přibližných shod jako příkaz patch.

source: It’s also a good idea to use the imperative present tense in these messages.
cs: Vytváříte-li zprávy k revizím v angličtině, často se také doporučuje používat rozkazovací způsob.

source: It’s also common to add a `last` command, like this:
cs: Běžně se také přidává příkaz `last`:

source: It’s also important to mention that this isn’t necessarily the fastest option if you’re using a shared mount of some kind.
cs: Zapomenout bychom neměli ani na to, že používáte-li sdílené připojení určitého druhu, nemusí být tato možnost vždy nutně nejrychlejší.

source: It’s also possible for Git to stage certain parts of files and not the rest.
cs: Git také může připravit k zapsání pouze určité části souborů a ignorovat jejich zbytek.

source: It’s also possible to take a series of commits and squash them down into a single commit with the interactive rebasing tool.
cs: Další možností, jak lze využít interaktivního nástroje přeskládání, je komprimace série revizí do jediné revize.

source: It’s also probably the most difficult protocol to set up.
cs: Pravděpodobně se také jedná o protokol s nejobtížnějším nastavením.

source: It’s also very similar in many ways to CVS, which was the big boy of the source-control world before that.
cs: V mnoha ohledech je velmi podobný systému CVS, který platil ve světě správy verzí před příchodem systému Subversion za nepřekonatelný.

source: It’s best to have a clean working state when you switch branches.
cs: Při přepínání větví je ideální, pokud máte čistý pracovní stav.

source: It’s easiest to push the remote branch you’re working on up to your repository, rather than merging into your master branch and pushing that up.
cs: Lepším řešením bude odeslat vzdálenou větev, na níž pracujete, do svého repozitáře, než ji začlenit do hlavní větve a tu pak celou odeslat.

source: It’s easiest to use a Linux server for it — these examples use a stock Ubuntu 8.10 server.
cs: Nejjednodušší je k ní použít linuxový server – tyto příklady používají běžný Ubuntu server 8.10.

source: It’s fine to keep that identifier there, in case you need to reference the Perforce change number later.
cs: Je dobré ponechat tu identifikátor pro případ, že budete někdy v budoucnu potřebovat odkázat na číslo změny Perforce.

source: It’s generally a good idea to do this in a testing branch and then hard-reset your master branch after you’ve determined the outcome is what you really want.
cs: Většinou se vyplatí provádět toto všechno v testovací větvi a k tvrdému resetu hlavní větve přistoupit až poté, co se ujistíte, že výsledek odpovídá vašim očekáváním.

source: It’s generally easier to think about them as work silos, where sets of commits graduate to a more stable silo when they’re fully tested (see Figure 3-19).
cs: Snáze si je můžeme představit jako pracovní zásobníky, v nichž se sada revizí dostává do stabilnějšího zásobníku, když úspěšně absolvovala testování (viz obrázek 3-19).

source: It’s generally recommended that you create annotated tags so you can have all this information; but if you want a temporary tag or for some reason don’t want to keep the other information, lightweight tags are available too.
cs: Obecně se doporučuje používat v zájmu úplnosti informací spíše anotované značky. Pokud však vytváříte pouze dočasnou značku nebo z nějakého důvodu nechcete zadávat podrobnější informace, můžete využívat i prosté značky.

source: It’s generally undesirable for the Git protocol to be the only access to your project.
cs: Většinou není žádoucí, aby protokol Git tvořil jediný přístup k vašemu projektu.

source: It’s generally used by huge projects with hundreds of collaborators; one famous example is the Linux kernel.
cs: Většinou se používá u obřích projektů se stovkami spolupracovníků. Možná nejznámějším příkladem je vývoj jádra Linuxu.

source: It’s important to note how this tool namespaces your remote references differently.
cs: Doplňme také, že tento nástroj odlišně přiřazuje jmenný prostor vzdálených referencí.

source: It’s important to note that `git diff` by itself doesn’t show all changes made since your last commit — only changes that are still unstaged.
cs: K tomu je třeba poznamenat, že příkaz `git diff` sám o sobě nezobrazí všechny změny provedené od poslední revize, ale jen změny, které zatím nejsou připraveny.

source: It’s important to note that anything your script prints to stdout will be transferred to the client.
cs: Měli bychom také upozornit, že všechno, co váš skript vypíše do standardního výstupu stdout, bude přeneseno také klientovi.

source: It’s important to note that it doesn’t check you out into that branch; if you commit at this point, that commit will go to `trunk` on the server, not `opera`.
cs: Měli bychom také dodat, že příkaz neprovede automaticky checkout dané větve. Pokud nyní zapíšete revizi, dostane se do větve `trunk` na serveru, ne do větve `opera`.

source: It’s important to note that nothing is checked out — you don’t have any files in your working directory at first.
cs: Měli bychom také dodat, že nejsou načtena žádná data, zatím neproběhl checkout žádných souborů do pracovního adresáře.

source: It’s important to note that the `fetch` command pulls the data to your local repository — it doesn’t automatically merge it with any of your work or modify what you’re currently working on.
cs: Měli bychom zmínit, že příkaz `fetch` stáhne data do vašeho lokálního repozitáře. V žádném případě ale data automaticky nesloučí s vaší prací ani jinak nezmění nic z toho, na čem právě pracujete.

source: It’s important to note that the reflog information is strictly local — it’s a log of what you’ve done in your repository.
cs: Měli bychom také doplnit, že informace záznamu reflog jsou čistě lokální, vztahují se pouze na to, co jste provedli ve svém repozitáři.

source: It’s important to note that these commits are listed in the opposite order than you normally see them using the `log` command.
cs: Tady bychom chtěli upozornit, že revize jsou uvedeny v opačném pořadí, než jste zvyklí v případě příkazu `log`.

source: It’s important to note that this file is version-controlled with your other files, like your `.gitignore` file.
cs: Za zmínku stojí, že je tento soubor verzován spolu s ostatními soubory, podobně jako třeba soubor `.gitignore`.

source: It’s important to note that this is literally all you need to do to run a useful Git server to which several people have access — just add SSH-able accounts on a server, and stick a bare repository somewhere that all those users have read and write access to.
cs: A to je skutečně vše, co je třeba ke spuštění serveru Git, k němuž bude mít přístup více lidí – na server stačí přidat SSH účty a umístit holý repozitář někam, kam budou mít všichni uživatelé oprávnění ke čtení i zápisu.

source: It’s important to note that when you do a fetch that brings down new remote branches, you don’t automatically have local, editable copies of them.
cs: Tady je důležité upozornit, že pokud vyzvedáváte data a stáhnete s nimi i nové vzdálené větve, nemáte automaticky jejich lokální, editovatelné kopie.
